freesbeeGE/test/dati/g/test12.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ge="http://ge.freesbee.unibas.it/">
    <soap:Header/>
    <soap:Body>
        <ge:consegnaMessaggio>
            <messaggioSoap>
                <confermaPubblicatori>
                    <pubblicatore>
                        <nomePubblicatore>K</nomePubblicatore>
                        <tipoPubblicatore>SPC</tipoPubblicatore>
                    </pubblicatore>
                    <pubblicatore>
                        <nomePubblicatore>J</nomePubblicatore>
                        <tipoPubblicatore>SPC</tipoPubblicatore>
                    </pubblicatore>
                    <nomeSottoscrittore>M</nomeSottoscrittore>
                    <tipoSottoscrittore>SPC</tipoSottoscrittore>
                    <categoriaSottoscrizione>Test27</categoriaSottoscrizione>
                </confermaPubblicatori>
            </messaggioSoap>
            <nomePubblicatore>NON_GE</nomePubblicatore>
            <tipoPubblicatore>SPC</tipoPubblicatore>
            <categoriaEventi>GEControlProtocol</categoriaEventi>
        </ge:consegnaMessaggio>
    </soap:Body>
</soap:Envelope>